[{"title":"Why Brittney Griner Could Be the Last American Basketball Star in Russia","keywords":["Basketball","Russia","NBA"],"url":"https://www.nytimes.com/2022/05/04/sports/basketball/brittney-griner-basketball-russia.html","author":["Jonathan Abrams"],"description":"The atrocities of the war in Ukraine and Griner's detention in Russia on drug charges could cut off a lucrative pipeline for women's basketball players.","content":"Mike Cound had decided on a figure — a reasonable salary request, he said — for a client who wanted to play for UMMC Yekaterinburg, a professional women's basketball team in Russia. As an experienced sports agent, that was what he was supposed to do.\n\nBut when he doubled the request on a whim, the team accepted without hesitation. And when another client injured her knee and could not play, the team paid her anyway. For yet another client, UMMC Yekaterinburg offered more than triple the amount she could make in the W.N.B.A. in the United States — if she would agree to play only in Russia.\n\nNone of that was normal. But UMMC Yekaterinburg was not like any other team.\n\n“There's nothing like it in sports,” Cound said. “The Yankees, maybe, in the old days with George Steinbrenner, when they would pay four times as much as somebody else.”\n\nThat type of spending and largess, fed by the Russian oligarchs who own teams for pride and political reasons, has drawn many W.N.B.A. players over the years to a country they barely know, thousands of miles from home, for a financial bounty generally unavailable in the United States.\n\nBut those days may be over. Against the backdrop of the war in Ukraine, Russia's detention of the W.N.B.A. star Brittney Griner on drug charges and increasing pressure from the W.N.B.A. to limit overseas play have forced an overdue reconsideration of the ethical and financial implications of playing basketball in Russia.","image_url":"https://static01.nyt.com/images/2022/04/22/sports/00wnba-intl1/merlin_205744884_7ce22b35-bf6d-4e5c-b20e-7aaca05c5615-superJumbo.jpg?quality=75&auto=webp","source_id":"The New York Times","source_image_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/NewYorkTimes.svg/2560px-NewYorkTimes.svg.png","category":["Sports","Politics"]},{"title":"Covid's toll in the U.S. reaches a once unfathomable number: 1 million deaths","keywords":["COVID","Death","USA"],"url":"https://www.nbcnews.com/news/us-news/covids-toll-us-reaches-1-million-deaths-unfathomable-number-rcna22105","author":["Elizabeth Chuck"],"description":"The U.S. on Wednesday surpassed 1 million Covid-19 deaths, according to data compiled by NBC News — a once unthinkable scale of loss even for the country with the world's highest recorded toll from the virus.","content":"The number — equivalent to the population of San Jose, California, the 10th largest city in the U.S. — was reached at stunning speed: 27 months after the country confirmed its first case of the virus. \n\n\"Each of those people touched hundreds of other people,\" said Diana Ordonez, whose husband, Juan Ordonez, died in April 2020 at age 40, five days before their daughter Mia's fifth birthday. \"It's an exponential number of other people that are walking around with a small hole in their heart.\"\n\n","image_url":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1120w,f_auto,q_auto:best/rockcms/2022-04/220428-covid-deaths-mn-1605-8628de.jpg","source_id":"NBC","source_image_url":"https://www.seekpng.com/png/detail/142-1421260_nbc-news-logo-nbc-news-logo-transparent.png","category":["Health","Politics"]},{"title":"A new subvariant is spreading rapidly in the United States","keywords":["COVID","USA","Pandemic"],"url":"https://www.nytimes.com/live/2022/05/04/world/covid-19-mandates-vaccine-cases/a-new-subvariant-is-spreading-rapidly-in-the-united-states?smid=url-copy","author":["Isabella Grullón Paz"],"description":"First came Omicron, then came its highly contagious subvariant, BA.2. That subvariant gave rise to its own subvariants, whose share of new coronavirus cases in the United States is growing.","content":"The coronavirus is constantly mutating. While some variants seem to vanish, causing little ripples of surges in their wake, others have kept driving large outbreaks. Experts say a new form, BA.2.12.1, is spreading rapidly and will probably become the dominant form of the virus in the United States in the next few weeks. There's no indication yet that it causes more severe disease than earlier forms did.\n\nIn the week endied Saturday, BA.2.12.1 made up about 36 percent of all new cases in the United States, according to estimates by the Centers for Disease Control and Prevention. That's up from 26 percent of cases in the prior week, and 16 percent of infections during the second week in April.\n\n(The latest figures are rough estimates, subject to revision as more data come in. Genetic sequencing of the virus is performed on just a portion of test samples across the country.)\n\nFirst detected in the United States by New York State health officials in April, BA.2.12.1 is spreading more rapidly than the first versions of the Omicron variant, which caused a huge surge in cases over the winter. The new version descends from BA.2 and appears to have spread even more quickly than BA.2, although the reasons are still under investigation.","image_url":"https://static01.nyt.com/images/2022/05/04/multimedia/04virus-briefing-ba2121/04virus-briefing-ba2121-superJumbo.jpg?quality=75&auto=webp","source_id":"The New York Times","source_image_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/NewYorkTimes.svg/2560px-NewYorkTimes.svg.png","category":["Health"]},{"title":"Hangzhou Asian Games Fun Run to start in Kuwait","keywords":["China","Kuwait","Asia"],"url":"https://www.chinadaily.com.cn/a/202205/05/WS6273a944a310fd2b29e5adac.html","author":["Ma Zhenhuan"],"description":"The first stop of the Hangzhou Asian Games Fun Run Series will kick off this month in Kuwait, which is the headquarters of the Olympic Council of Asia.","content":"Since the 15th Asian Games in Doha in 2006, the Fun Run Series, organized by the council, has brought people together from different walks of life and enabled them to share the excitement.\n\nThe last Fun Run Series, the 18th Asian Games in Jakarta and Palembang, Indonesia in 2018 featured a total of 31 events in 28 countries and regions in Asia.\n\nAt a news conference on Tuesday, Husain Al-Musallam, director-general of the Olympic Council of Asia, said he hopes that Hangzhou Asian Games Fun Run Series can deliver a healthy and active lifestyle.","image_url":"https://img2.chinadaily.com.cn/images/202205/05/6273a943a310fd2bec87326b.jpeg","source_id":"China Daily","source_image_url":"https://www.chinadaily.com.cn/image_e/2016/logo_art.jpg","category":["Sports"]},{"title":"China's lockdowns leave millions out of work","keywords":["COVID","China","Pandemic"],"url":"https://www.nytimes.com/2022/05/05/business/china-shanghai-covid-lockdown-economy.html?smid=url-copy","author":["Vivian Wang"],"description":"Lockdowns in China have caused large increases in unemployment across the country. With government restrictions clamping down on residents' ability to get to work and operate businesses, the situation remains dire for those looking to survive in the pandemic.","content":"As China battles its worst coronavirus outbreaks, its uncompromising determination to eliminate infections has left millions unable to work. Stringent lockdowns, hitting city after city, have forced factories and businesses to shut, sometimes for weeks, including in some of the country's most important economic centers.\n\nTwo groups have been especially hard-hit: migrant workers — the roughly 280 million laborers who travel from rural areas to cities to work in sectors such as manufacturing and construction — and recent college graduates. Nearly 11 million college students, a record, are expected to graduate this year.\n\n","image_url":"https://static01.nyt.com/images/2022/05/05/business/05china-virus-jobs-1/05china-virus-jobs-1-superJumbo-v2.jpg?quality=75&auto=webp","source_id":"The New York Times","source_image_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/NewYorkTimes.svg/2560px-NewYorkTimes.svg.png","category":["Health"]},{"title":"Ukraine war: How Germany is getting rid of Russian oil","keywords":["Russia","Germany","Ukraine","Oil"],"url":"https://www.bbc.com/news/world-europe-61318690","author":["Damien McGuinness"],"description":"The pipeline that carries Russian oil to Germany is called Friendship, or Druzhba in Russian. But Vladimir Putin's attack on Ukraine has destroyed any lingering feelings of affection.\n","content":"Druzhba opened in the 1960s, transporting oil more than 5,000km (3,100 miles) from what was then the Soviet Union to Schwedt in former communist East Germany.\n\nThe refinery in Schwedt is key to the European Union's plan to phase out Russian oil imports by the end of 2022, a proposal that has won Germany's support.\n\nSince the invasion the German government has dramatically reduced its dependence on Russian oil from 35% to 12%, all of which comes to the refinery in Schwedt.\n\nBut people here are worried what an embargo might mean for German regions like this, where thousands of livelihoods depend on Russian energy.\n\n\"We are very worried and very shocked,\" says Schwedt's mayor, Annekathrin Hoppe, who once worked in the refinery herself.\n\n","image_url":"https://ichef.bbci.co.uk/news/976/cpsprodpb/B041/production/_124412154_mediaitem124412152.jpg","source_id":"BBC","source_image_url":"https://www.logodesignlove.com/wp-content/uploads/2008/08/BBC-logo-2021.jpg","category":["Politics","Economics"]},{"title":"'Heavy, bloody battles' as Russian troops break into steel plant","keywords":["Ukraine","USA","War"],"url":"https://www.usatoday.com/story/news/politics/2022/05/04/ukraine-russia-invasion-live-updates/9639711002/","author":["Jorge L. Ortiz"],"description":"The sprawling steel plant that has exemplified Ukraine's resolve as its final holdout in the embattled city of Mariupol appears in danger of falling to Russian troops. The commander of the main defending force at the Azovstal steel mill said the Russians have broken into the mill's compound.","content":"The sprawling steel plant that has exemplified Ukraine's resolve as its final holdout in the embattled city of Mariupol appears in danger of falling to Russian troops.\n\nThe commander of the main defending force at the Azovstal steel mill said the Russians have broken into the mill's compound, where limited evacuations of besieged civilians took place over the weekend. The steelworks has been under heavy aerial bombardment and shelling that halted the evacuations.\n\nRussian incursions have occurred for two days and \"there are heavy, bloody battles,'' Denys Prokopenko, commander of the Ukrainian Azov regiment, said in a video posted Wednesday after the Kremlin denied its forces were trying to storm the plant.\n\nThe Kyiv Independent -- an English-language Ukrainian newspaper -- reported the Russians broke in. Russian state TV showed smoke rising over Azovstal.","image_url":"https://www.gannett-cdn.com/presto/2022/05/04/USAT/1c8d092f-ad55-4be3-a234-cafbeec12f55-Ukraine6.jpg?width=600&height=380&fit=crop&format=pjpg&auto=webp","source_id":"USA Today","source_image_url":"https://1000logos.net/wp-content/uploads/2017/07/Color-USA-Today-Logo.jpg","category":["Politics"]},{"title":"Zelenskyy calls for truce for Azovstal rescue","keywords":["Ukraine","USA","War"],"url":"https://www.aljazeera.com/news/2022/5/4/russia-facing-stiff-ukrainian-resistance-in-donbas-us-says-liveblog","author":["Sasha Petrova"],"description":"Antony Blinken has met with Swedish Foreign Minister Ann Linde in Washington and reaffirmed “our commitment to NATO's open door policy”, a statement from the US state department has said.","content":"Zelenskyy has said that “we need to continue the silence” to rescue the others still trapped in the Azovstal steel plant.\n\n“We are negotiating and hope to continue rescuing people from Azovstal, from Mariupol. There are still civilians. Women, children,” he said in his nighttime address.\n\n“To save them, we need to continue the silence. The Ukrainian side is ready to provide it. It takes time to just lift people out of those basements, out of those underground shelters. In the current conditions, we cannot use special equipment to clear the debris. Everything is done manually,” he added.\n\nUkrainian officials say some 200 civilians as well as Ukrainian fighters are still holed up in the plant's network of underground bunkers.\n\n","image_url":"https://www.aljazeera.com/wp-content/uploads/2022/05/azovstal.jpg?resize=770%2C513","source_id":"Al Jazeera","source_image_url":"https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Aljazeera_eng.svg/1200px-Aljazeera_eng.svg.png","category":["Politics","Economics"]},{"title":"Covid-19's full death toll is nearly three times higher than reported, WHO data suggests","keywords":["COVID","Pandemic","Death"],"url":"https://www.cnn.com/2022/05/05/health/covid-excess-mortality-who-data/index.html","author":["Carma Hassan"],"description":"About 14.9 million people around the world died as a direct or indirect result of Covid-19 in the period between January 1, 2020, and December 31, 2021, according to new estimates from the World Health Organization.","content":"There were 5.4 million Covid-19 deaths reported to WHO during that timeframe, resulting in an excess mortality estimate of 9.5 million more deaths than what was reported.\n\"Excess mortality is the difference between the number of deaths that have been recorded and those that would be expected in the absence of the pandemic,\" said Samira Asma, assistant director-general for the Data, Analytics and Delivery for Impact Division of WHO.\nThe 14.9 million deaths include \"deaths directly attributed to Covid-19 that were reported to WHO, deaths directly attributed to Covid-19 that were not counted or reported ... deaths indirectly associated with the pandemic due to the wider impact on health systems and society,\" Asma explained. The figure also subtracts any deaths that were avoided due to changes in social behaviors, such as fewer fatalities from car wrecks because of lockdowns or travel restrictions.","image_url":"https://cdn.cnn.com/cnnnext/dam/assets/200326033413-elmhurst-hospital-new-york-13-deaths.jpg","source_id":"CNN","source_image_url":"https://www.logodesignlove.com/wp-content/uploads/2010/06/cnn-logo-white-on-red.jpg","category":["Health"]},{"title":"Cardi B Slams Rumors That She and Billie Eilish Had Drama at the Met Gala Afterparty","keywords":["Celebrity","Style","Met Gala"],"url":"https://www.etonline.com/cardi-b-slams-rumors-that-she-and-billie-eilish-had-drama-at-the-met-gala-afterparty-183597","author":["Zach Seemayer"],"description":"Billie Eilish and Cardi B don't have any bad blood, no matter how much the internet seems to want to believe otherwise.","content":"Following Monday's Met Gala at the Metropolitan Museum of Art in New York City -- where both Cardi and Billie slayed in their stunning red carpet styles -- both stars then attended a gala afterparty at The Standard hotel.\n\nIt was at this afterparty where rumors of drama and shade-throwing were first sparked. While Cardi made a lively speech kicking off the big party and greeting attendees, an out-of-context video showed Billie mouthing the words \"So weird,\" which many presumed to indicate Billie was mocking Cardi.\n\nHowever, amid the clip going viral, Cardi took to Twitter to stomp out the speculation.\n\n\"I hate the internet cause one, how do y'all turn one of the most lit parties into drama? Two, Ocean eyes is the song I cater to my daughter. Three, Billie is my f**kin baby,\" Cardi wrote. \"Yesterday, from the met to the party, everything was drama free. Why do yallwanna turn everything into mess?\"\n\nAlongside the post, Cardi shared some voice notes sent between herself and the \"Happier Than Ever\" singer, where Billie expressed concern that Cardi would have seen the clip and gotten mad.\n\n\"Oh my God, I was so worried you were gonna see that. I was f**king calling the people around you weird because everyone was f**king coming around shoving their phones in your *ss,\" Billie says in the audio clip. \"I was like, 'Just look at her with your eyes!'\"\n\n\"The internet is trying to divide us,\" Cardi responded in her own audio note. \"They don't understand that you're my baby.\"\n\n","image_url":"https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2022-05/Cardi_Billie_MetGala_Getty_1280.jpg?h=c673cd1c&itok=ODnn79Gk","source_id":"Entertainment Tonight","source_image_url":"https://cdn.shopify.com/s/files/1/0264/8155/7613/articles/entertainment-tonight-logo.jpg?v=1581035954","category":["Culture"]},{"title":"Dribble Handoff: College basketball coaches most likely to follow Jay Wright's lead by retiring early","keywords":["Basketball","College"],"url":"https://www.cbssports.com/college-basketball/news/dribble-handoff-college-basketball-coaches-most-likely-to-follow-jay-wrights-lead-by-retiring-early/","author":["David Cobb"],"description":"In just over a year, a significant portion of college basketball's coaching brain trust has left the sport, with Mike Krzyzewski, Roy Williams and Jay Wright headlining those opting to retire amid the sport's changing landscape. ","content":"At just 60 and at a time when many of the sport's big-name coaches routinely work until age 70 or beyond, Wright's departure from the sideline makes him something of an outlier. As a well-polished figure in the sport with a couple of recent national titles, many assumed Wright was positioned to assume the leadership void created by Krzyzewski and Williams retiring. Instead, the void is widening at a time when college basketball needs trusted figures to chart its course.\n\nAs the proliferation of transferring and the arrival of the NIL era change what's required of college coaches, it's worth wondering if Wright's retirement may start a trend. After decades of increasing salaries, many high-major head coaches should be well-positioned to retire early if they grow fatigued of the sport's changes.","image_url":"https://sportshub.cbsistatic.com/i/r/2018/03/11/0dbe2e0d-48a5-4ac5-86b5-bbd566f58d67/thumbnail/770x433/86e27230feae12920c070a22c88339f4/usatsi-10694575-ed-cooley-rips-pants-providence-big-east-final-msg.jpg","source_id":"CBS Sports","source_image_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/CBS_Sports_logo.svg/2560px-CBS_Sports_logo.svg.png","category":["Sports"]},{"title":"Kim Kardashian Takes Marilyn Monroe's “Happy Birthday, Mr. President” Dress Out for a Spin","keywords":["Met Gala","Celebrity","Style"],"url":"https://www.vogue.com/article/kim-kardashian-met-gala-2022","author":["Chioma Nnadi"],"description":"Kim Kardashian put on an homage to Marilyn Monroe's iconic style at the 2022 Met Gala","content":"No one loves a Met Gala red carpet surprise more than Kim Kardashian—so it's no wonder rumors of her dramatic transformation into Marilyn Monroe were swirling 48 hours before the ball. Naturally, the big reveal tonight was nothing short of jaw-dropping. “The idea really came to me after the gala in September last year. I thought to myself, what would I have done for the American theme if it had not been the Balenciaga look? What's the most American thing you can think of? And that's Marilyn Monroe,” says Kardashian. The instant she stepped foot on the red carpet wearing the infamous glittering dress, her hair platinum blonde and perfectly coiffed, the reference was unmistakable. “For me the most Marilyn Monroe moment is when she sang “Happy Birthday,” to JFK, it was that look.”\n\nWhen I speak to the reality TV star and entrepreneur over the phone this past Sunday afternoon, she is in the midst of getting her hair bleached blonde. “I'm spending the whole day just dyeing my hair, 14 hours straight,” she says laughing. Kardashian clearly relishes the challenge of a tricky-to-pull-off fashion moment. Between the impossibly waist-whittled “wet look” Mugler dress she wore in 2019 and the mysterious Balenciaga Zentai-style outfit she donned last year, she's especially game to go the extra mile for the Met Gala. Still, orchestrating a style maneuver of this magnitude would require new levels of commitment and planning.","image_url":"https://cdn.newsapi.com.au/image/v1/ba89c2909ca495cd94121b47cc4aac71?width=650","source_id":"Vogue","source_image_url":"https://hyperpix.net/wp-content/uploads/2020/06/vogue-logo-font-free-download-1200x675.jpg","category":["Culture","Style"]},{"title":"Death Toll During Pandemic Far Exceeds Totals Reported by Countries, W.H.O. Says","keywords":["Death","Pandemic","COVID"],"url":"https://www.nytimes.com/2022/05/05/health/covid-global-deaths.html","author":["Benjamin Mueller"],"description":"Nearly 15 million more people died during the first two years of the pandemic than would have been expected during normal times, the organization found. The previous count of virus deaths, from countries' reporting, was six million.","content":"In Mexico, the excess death toll during the first two years of the pandemic was twice as high as the government's official tally of Covid deaths.\n\nIn Egypt, excess deaths were roughly 12 times as great as the official Covid toll.\n\nIn Pakistan, the figure was eight times as high.\n\nThose estimates, along with others for nearly every nation, were calculated by a global panel of experts assembled by the World Health Organization and published on Thursday. Together they offered a startling glimpse of how drastically the death counts reported by many governments have understated the true toll of the pandemic.\n\nOverall, roughly 14.9 million more people worldwide died in 2020 and 2021 than would have been expected to in normal times, the experts estimated. Most were victims of Covid itself, they said, but some died because the pandemic made it more difficult to get medical care for ailments such as heart attacks. The previous toll, based solely on death counts reported by countries, was six million.","image_url":"https://static01.nyt.com/images/2022/05/05/science/05-virus-WHO-excess2/merlin_190748610_a0e34802-0209-4036-abdf-92cdabf5531f-superJumbo.jpg?quality=75&auto=webp","source_id":"The New York Times","source_image_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/NewYorkTimes.svg/2560px-NewYorkTimes.svg.png","category":["Health"]},{"title":"Warriors' Gary Payton II out 3-5 weeks after hard Dillon Brooks foul","keywords":["Basketball","NBA"],"url":"https://sports.yahoo.com/warriors-gary-payton-ii-out-3-5-weeks-hard-dillon-brooks-foul-011525013.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAA6r98yPZ_2VagJGzi71vtO9GXscydYWzWxT2uVnz3QxmCHcJr4Xq8pifOMNOV2K8lQ4laLAr8n6k_uWIi62qkmQynjJ37CRPp_y7zNaLGxDritOMRmrBTHeEzVkH1CEuTYsPbBsUZMB3G3pNXMXA-moM9DOBAoHIBOuwgBGMe1g","author":["Jack Baer"],"description":"Gary Payton II is out for the Golden State Warriors' second-round series, but perhaps not the entire playoffs if everything goes according to plan.","content":"Payton's time in this series is over after posting eight points, seven assists and three rebounds in 23 minutes in Game 1. He played only two minutes in Game 2. He has been one of the team's best stories this year, going from spending much of his time in the G League to becoming a real rotation piece for a contender.\n\nPayton's defense will be missed in particular. The Warriors elevated him to the starting lineup because he was their best option to defend Grizzlies star Ja Morant. Without him, the Warriors watched Morant drop 47 points for the key win.\n\nThe Warriors have plenty of perimeter players to throw at Morant, but it's hard to see any one name stepping up to the level of Payton.\n\nThe good news is Payton isn't done for the season, as a three-week return would return him midway through the Western Conference finals if the Warriors make it that far. Even a five-week return would conceivably have him back in time to see some NBA Finals action, which begins on June 2.","image_url":"https://s.yimg.com/ny/api/res/1.2/qrT8_IG82IMacrYfZ86CWw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY0MTtjZj13ZWJw/https://s.yimg.com/os/creatr-uploaded-images/2022-05/61c46df0-cb53-11ec-97d7-c3f5b3cf9d47","source_id":"Yahoo Sports","source_image_url":"https://s.yimg.com/rz/p/yahoo_sports_en-US_h_w_sportsv2_2.png","category":["Sports"]},{"title":"European businesses grow wary of investing in China under its drastic Covid policies","keywords":["Europe","China","COVID","Pandemic"],"url":"https://www.nytimes.com/2022/05/05/business/china-covid-lockdown-europe.html?smid=url-copy","author":["Keith Bradsher"],"description":"A business group warned on Thursday that China's “dynamic zero Covid” policies have left European companies considerably less willing to continue investing in the country.","content":"A survey by the European Union Chamber of Commerce in China found that the tone among European businesses in the country had soured since January, when a survey found broad optimism and plans for further investment.\n\n“We had a double whammy in February and March with the Ukraine invasion and the Covid lockdowns, and it had an incredible impact,” said Joerg Wuttke, the chamber's president.\n\nThe survey, conducted from April 20 to 26, provides new data on how the increasingly visible supply chain problems from China's Covid-19 lockdowns, including interruptions in trucking services and factory shutdowns, are hurting the country's competitiveness as a global manufacturing center and a magnet for Western investment and technology transfers.\n\nPremier Li Keqiang has said that cities and provinces should try to minimize local economic disruption from their Covid measures. Mr. Wuttke, the most visible leader of China's foreign business community, has been a critic in recent weeks of the economic disruption.\n","image_url":"https://static01.nyt.com/images/2022/05/05/multimedia/05virus-briefing-europe-china-covid/05virus-briefing-europe-china-covid-superJumbo.jpg?quality=75&auto=webp","source_id":"The New York Times","source_image_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/NewYorkTimes.svg/2560px-NewYorkTimes.svg.png","category":["Health"]},{"title":"Chris Mullin rips Dillon Brooks for Flagrant 2 foul: Worthy of 'major brawl'","keywords":["Basketball","NBA"],"url":"https://sports.yahoo.com/chris-mullin-rips-dillon-brooks-064945368.html","author":["Angelina Martin"],"description":"After Dillon Brooks' scary Flagrant 2 foul on Gary Payton II during the Warriors' Game 2 loss to the Memphis Grizzlies on Tuesday night, there was no shortage of opinions on the controversial play.","content":"“It's three minutes into the game, so it's uncalled for, it's dirty” Mullin began. “We can't speak on intention, we don't know that, but when you look at the replay, [Brooks] was nowhere near the ball. He just took Gary Payton II out to the ground, hit him in the head and the neck. Yeah, he broke every code, never mind NBA code.”\n\nMullin was referring to Warriors coach Steve Kerr's postgame comments that Brooks “broke the code” when he wound up and clocked Payton across the head as the Golden State guard went up for a dunk in the first quarter.\n\nAn irate Kerr also called the foul “dirty” during a mid-game interview with TNT's Jared Greenberg before the start of the second quarter, and both Steph Curry and Draymond Green vocalized their own anger about the play during their postgame press conferences.\n\nThe “Warriors Live: Playoff Edition” broadcast crew echoed Golden State's sentiments, with both Bonta Hill and Mullin agreeing that the hard foul would have resulted in a “brawl” if it happened during a pickup game, let alone an NBA playoff game.\n\n","image_url":"https://cdn.nba.com/manage/2017/08/chris-mullin-warriors-smile-archive.jpg","source_id":"NBC Sports","source_image_url":"https://s.yimg.com/ny/api/res/1.2/9Vbl2.V0OZQ5XFzNfAMVKg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIxODtoPTQ4O2NmPXdlYnA-/https://s.yimg.com/os/creatr-uploaded-images/2020-12/a4d17030-38b4-11eb-a7fb-5699c70bdc8b","category":["Sports"]},{"title":"Warriors-Grizzlies Series Takes an Ugly Turn After Reckless Dillon Brooks Foul","keywords":["NBA","Basketball"],"url":"https://bleacherreport.com/articles/2955926-warriors-grizzlies-series-takes-an-ugly-turn-after-reckless-dillon-brooks-foul?utm_source=cnn.com&utm_medium=referral&utm_campaign=editorial","author":["Sean Highkin"],"description":"Less than three minutes into Game 2, Grizzlies forward Dillon Brooks was ejected for knocking Warriors guard Gary Payton II to the floor as Payton was attempting a layup. Brooks swung at the ball, instead hitting Payton in the head. Brooks was given a flagrant-2 and ejected.","content":"The NBA world had about two hours to enjoy a masterful 47-point Ja Morant performance and the Grizzlies' evening out the most compelling series of the second round before the focus returned to litigating Brooks' foul.\n\nIn his between-quarter interview on the TNT broadcast, Warriors coach Steve Kerr called the foul \"dirty.\" After the game, he said Brooks \"broke the code\" by knocking Payton out of the air and injuring him. Green called it a \"bulls--t foul,\" which is hard to argue with but isn't really a sentiment most people want to hear from him.\n\n\"Everybody's going to compete,\" Kerr said. \"Everybody's going to fight. But there's a code in this league, a code that players follow where you never put a player's season or career in jeopardy.\"","image_url":"https://cdn.vox-cdn.com/thumbor/px5XT96S9yZTJialwUOJFau8Wx0=/0x0:3300x4800/1200x800/filters:focal(1381x1684:1909x2212)/cdn.vox-cdn.com/uploads/chorus_image/image/70815687/1360714364.0.jpg","source_id":"Bleacher Report","source_image_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Bleacher_Report_logo.svg/1024px-Bleacher_Report_logo.svg.png?20180211034141","category":["Sports"]},{"title":"COVID coverage for all dries up even as hospital costs rise","keywords":["COVID","Pandemic","Death"],"url":"https://apnews.com/article/covid-business-health-chicago-congress-ab7e18b905e6e9974aacfafdd6d65122","author":["Heather Hollingsworth"],"description":"For the first time, the U.S. came close to providing health care for all during the coronavirus pandemic — but for just one condition, COVID-19.","content":"Now, things are reverting to the way they were as federal money for COVID care of the uninsured dries up, creating a potential barrier to timely access.\n\nBut the virus is not contained, even if it's better controlled. And safety-net hospitals and clinics are seeing sharply higher costs for salaries and other basic operating expenses. They fear they won't be prepared if there's another surge and no backstop.\n\n“We haven't turned anybody away yet,” said Dr. Mark Loafman, chair of family and community medicine at Cook County Health in Chicago. “But I think it's just a matter of time ... People don't get cancer treatment or blood pressure treatment every day in America because they can't afford it.”\n\nA $20 billion government COVID program covered testing, treatment and vaccine costs for uninsured people. But that's been shut down. Special Medicaid COVID coverage for the uninsured in more than a dozen states also likely faces its last months.","image_url":"https://storage.googleapis.com/afs-prod/media/248b63a04fb34da1a8204827dbb22002/1000.jpeg","source_id":"Associated Press","source_image_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Associated_Press_logo.svg/2560px-Associated_Press_logo.svg.png","category":["Health","Economics"]},{"title":"EU Proposes Ban on Russian Oil Imports","keywords":["Ukraine","USA","War","Oil"],"url":"https://www.wsj.com/articles/eu-proposes-ban-on-russian-oil-imports-11651648950?mod=hp_lead_pos7","author":["Laurence Norman"],"description":"The European Union proposed a ban on imports of Russian crude within six months and on refined oil products from the country by year-end, sending crude prices higher as member states look for alternatives.","content":"Oil prices jumped on the announcement. Brent crude futures, the international benchmark in energy markets, rose 4.9% to $110.14 a barrel. U.S. benchmark crude was up 5.3% to $107.81 a barrel.\n\nA European embargo could reduce global oil supplies because not every barrel of Russian oil that once landed in Europe will be rerouted to buyers in other markets, traders and analysts say. Russian production of refined oil products and crude already has fallen since the invasion of Ukraine in response to reduced demand overseas and in the domestic Russian market.\n\nEuropean Commission President Ursula von der Leyen outlined the proposal in a speech to the European Parliament. She said the EU's executive body also is proposing to take Russia's biggest bank, Sberbank, and two other Russian banks off the Swift financial-messaging system. The commission also is planning to ban three major Russian state-owned broadcasters from the EU and to target Russian military officials accused of alleged war crimes.\n\nEU member states entered difficult discussions over the sanctions package Wednesday, with Hungary repeating its call for a slower transition away from Russian oil while Poland and the Baltic states saying the phaseout of oil was too slow. All 27 countries would need to sign off on the package for it to go into effect. EU officials are pushing for a decision this week.\n\n“With all these steps, we are depriving the Russian economy from its ability to diversify and modernize,” Ms. von der Leyen said.\n\nEuropean refiners have been scouring global markets for alternative crude sources, boosting imports from the U.S., West Africa and the Middle East. Diesel prices in the region, meanwhile, have climbed to records on the prospect of reduced flows from Russian refiners.\n\nWhile the proposed ban would affect only oil imports, the EU also has been scrambling to diversify its sourcing of natural gas. Terminals to import liquefied natural gas took in a record amount of the superchilled fuel for the time of year in April, according to commodity-tracking firm Vortexa. Oil imports from non-Russian suppliers, meanwhile, hit their highest level since the start of the pandemic.","image_url":"https://images.wsj.net/im-537149/?width=860&size=1.5&pixel_ratio=1.5","source_id":"The Wall Street Journal","source_image_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/The_Wall_Street_Journal.svg/2560px-The_Wall_Street_Journal.svg.png","category":["Politics","Economics"]},{"title":"Jason Kidd says Mavericks need players besides Luka Doncic to step up with Dallas in 2-0 hole against Phoenix Suns","keywords":["Basketball","NBA"],"url":"https://www.espn.com/nba/story/_/id/33859096/jason-kidd-says-mavericks-need-players-besides-luka-doncic-step-dallas-2-0-hole-phoenix-suns","author":["Tim MacMahon"],"description":"Dallas Mavericks coach Jason Kidd has delivered a similar message after both games so far in the Western Conference semifinals: Luka Doncic needs a lot more help against the top-seeded Phoenix Suns.","content":"Dallas wasted another brilliant offensive performance by Doncic in Wednesday's Game 2, when he scored 35 points on 13-of-22 shooting in a 129-109 loss as the Suns seized a 2-0 series lead. The Suns repeatedly targeted Doncic defensively while scorching the Mavs for 71 points in the second half.\n\n\"He had a great game, but no one else showed,\" Kidd said. \"We've got to get other guys shooting the ball better. We can't win with just him out there scoring 30 a night -- not at this time of the year. And we're playing the best team in the league, so we've got to get other guys going.\"\n\nKidd specifically mentioned that the Mavs need much more production from guards Jalen Brunson and Spencer Dinwiddie, who have combined for only 41 points on 32.6% shooting in the two losses at the Footprint Center. It's an especially stark contrast to the previous series for Brunson, who starred in the first-round victory over the Utah Jazz, averaging 27.8 points in the six-game series.\n","image_url":"https://lede-admin.defector.com/wp-content/uploads/sites/28/2022/05/GettyImages-1395082762.jpeg?w=1200","source_id":"ESPN","source_image_url":"https://variety.com/wp-content/uploads/2013/09/espn-logo.jpg?w=681&h=383&crop=1","category":["Sports"]},{"title":"Mariupol steel mill battle rages as Ukraine repels attacks","keywords":["Ukraine","War","Russia","Europe"],"url":"https://apnews.com/article/russia-ukraine-war-aab9f48d6c4941d2f4d4b5d3fa8ed751","author":["Jon Gambrell"],"description":"Heavy fighting raged Thursday at the shattered steel plant in Mariupol as Russian forces attempted to finish off the city's last-ditch defenders and complete the capture of the strategically vital port.","content":"The bloody battle came amid growing suspicions that President Vladimir Putin wants to present the Russian people with a major success — or announce an escalation of the war — in time for Victory Day on Monday. That is the biggest patriotic holiday on the Russian calendar, marking the Soviet Union's triumph over Nazi Germany.\n\nSome 2,000 Ukrainian fighters, by the Russians' estimate in recent weeks, were holed up in the tunnels and bunkers under the sprawling Azovstal steelworks in Mariupol, the last pocket of resistance in a city largely reduced to rubble over the past two months. A few hundred civilians were also believed trapped there.\n\nCapt. Sviatoslav Palamar, who as deputy commander of Ukraine's Azov Regiment led defenders inside the mill, told Ukrainian Channel 24 that Russian troops were inside the plant for a third day and were meeting fierce resistance.\n\n","image_url":"https://storage.googleapis.com/afs-prod/media/9538fd48e9644bc392b5e6e115cfa7af/800.jpeg","source_id":"Associated Press","source_image_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Associated_Press_logo.svg/2560px-Associated_Press_logo.svg.png","category":["Politics","Economics"]},{"title":"Why 9 May Victory Day is so important for Russia","keywords":["Russia","War","Putin"],"url":"https://www.bbc.com/news/world-europe-61332283","author":["Paul Kirby"],"description":"It has become an annual event - the military parade in Red Square in Moscow and cities across Russia on 9 May, when the country marks its victory over Nazi Germany in 1945.","content":"Under Vladimir Putin, Victory Day has become a show of strength of troops and military hardware, as well as a chance to remember the sacrifices of World War Two. Twenty-seven million Soviet citizens died, by far the greatest loss of any country, in what Russians call the Great Patriotic War.\n\nThis year, the event has taken on a significance of its own. Far from liberating Europe, Russia has waged months of war against its neighbour Ukraine and is devoid of any real form of military victory that it can celebrate.\n\nRegiments that played a key role in the war will parade in front of the top brass and the president, whose address will echo across Red Square and be scrutinised for what to expect next. Russia's leader often uses this moment to send messages of intent.\n\nThe Victory Day parade was occasionally marked in the Soviet era and revived by President Boris Yeltsin for the 50th anniversary in 1995, but it was Vladimir Putin in 2008 who made it an annual event featuring military hardware. Russian identity has been largely created with Victory Day in the background, with schoolbooks and history books focusing on Russia as Europe's wartime liberators.","image_url":"https://ichef.bbci.co.uk/news/976/cpsprodpb/116E4/production/_124569317_putinvic.jpg","source_id":"BBC","source_image_url":"https://www.logodesignlove.com/wp-content/uploads/2008/08/BBC-logo-2021.jpg","category":["Politics","Economics"]},{"title":"Covid: World's true pandemic death toll nearly 15 million, says WHO","keywords":["COVID","Pandemic","USA"],"url":"https://www.bbc.com/news/health-61327778","author":["Naomi Grimley"],"description":"The Covid pandemic has caused the deaths of nearly 15 million people around the world, the World Health Organization (WHO) estimates.","content":"That is 13% more deaths than normally expected over two years.\n\nThe WHO believes many countries undercounted the numbers who died from Covid - only 5.4 million were reported.\n\nIn India, there were 4.7 million Covid deaths, it says - 10 times the official figures - and almost a third of Covid deaths globally.\n\nThe Indian government has questioned the estimate, saying it has \"concerns\" about the methodology, but other studies have come to similar conclusions about the scale of deaths in the country.","image_url":"https://ichef.bbci.co.uk/news/976/cpsprodpb/121BC/production/_118627147_hi067326126.jpg","source_id":"BBC","source_image_url":"https://www.logodesignlove.com/wp-content/uploads/2008/08/BBC-logo-2021.jpg","category":["Health"]},{"title":"How Tyler Herro fuels the best version of the Miami Heat: 'Last year was the aberration, not this year'","keywords":["NBA","Basketball"],"url":"https://www.espn.com/nba/story/_/id/33779775/how-tyler-herro-fuels-best-version-miami-heat-last-year-was-aberration-not-year","author":["Israel Gutierrez"],"description":"Tyler Herro is leading a remarkable playoff run for the Miami Heat in the 2021-2022 NBA season.","content":"JUST ACROSS THE street from FTX Arena, on a billboard space that was regularly occupied by Dwyane Wade during his legendary Miami Heat tenure, Tyler Herro is all angles, pictured in a Hudson Jeans advertisement dribbling a basketball, wearing a short-sleeved black T-shirt, ripped black jeans and black boots.\n\nInside the arena on this Monday in March, Herro starts his night against the Sacramento Kings by modeling that springy jump shot, floating slightly to his right and nailing a 3-pointer from the \"Ray Allen corner.\"\n\nBy the finish of this Heat win, which ends a tumultuous four-game losing streak that featured a sideline shouting match between Jimmy Butler, Udonis Haslem and Erik Spoelstra, Herro had dropped in a few more 3s on his way to 20 points, six assists and five boards.\n\nNow in his third year, with a breakthrough regular season behind him and probable Sixth Man of the Year award ahead, Herro is playing in these playoffs against the Atlanta Hawks as possibly the most important player on the No. 1 team in a loaded Eastern Conference. As the most natural scorer on a deep Heat team, the 22-year-old reserve is most suited to unlocking a Miami offense that has been the source of consternation late in the season, and late in games all season.","image_url":"https://cdn.nba.com/manage/2021/09/herro-iso-092321.jpg","source_id":"ESPN","source_image_url":"https://variety.com/wp-content/uploads/2013/09/espn-logo.jpg?w=681&h=383&crop=1","category":["Sports"]},{"title":"Congress returns to big fights over Ukraine aid, Title 42, COVID-19 relief","keywords":["COVID","Ukraine","Pandemic"],"url":"https://www.usatoday.com/story/news/2022/04/25/congress-ukraine-title-42-covid/7418202001/?gnt-cfr=1","author":["Candy Woodall"],"description":"Congress continues to have discourse over next steps regarding Ukraine. Title 42 marks a new paradigm in US action against Russian involvement in Crimea, namely in regards to its increased investments in anti-tank and anti-aircraft technology.","content":"Congress will return from spring recess on Monday afternoon to requests from President Joe Biden, surging consumer prices, an immigration debate, party infighting and looming deadlines. \n\nLawmakers will make decisions on White House requests, such as aid packages for COVID-19 relief and Ukraine, along with some of their own competing priorities.\n\n","image_url":"https://www.pewresearch.org/wp-content/uploads/2019/01/FT_19.01.23_CongressProductivity_feature.jpg?w=1200&h=628&crop=1","source_id":"USA Today","source_image_url":"https://1000logos.net/wp-content/uploads/2017/07/Color-USA-Today-Logo.jpg","category":["Economics","Politics"]},{"title":"U.S. Intelligence Is Helping Ukraine Kill Russian Generals","keywords":["Ukraine","USA","War"],"url":"https://www.nytimes.com/2022/05/04/us/politics/russia-generals-killed-ukraine.html","author":["Julian E. Barnes"],"description":"The United States has provided intelligence about Russian units that has allowed Ukrainians to target and kill many of the Russian generals who have died in action in the Ukraine war, according to senior American officials.","content":"WASHINGTON — The United States has provided intelligence about Russian units that has allowed Ukrainians to target and kill many of the Russian generals who have died in action in the Ukraine war, according to senior American officials.\nUkrainian officials said they have killed approximately 12 generals on the front lines, a number that has astonished military analysts.\nThe targeting help is part of a classified effort by the Biden administration to provide real-time battlefield intelligence to Ukraine. That intelligence also includes anticipated Russian troop movements gleaned from recent American assessments of Moscow's secret battle plan for the fighting in the Donbas region of eastern Ukraine, the officials said. Officials declined to specify how many generals had been killed as a result of U.S. assistance.\nThe United States has focused on providing the location and other details about the Russian military's mobile headquarters, which relocate frequently. Ukrainian officials have combined that geographic information with their own intelligence — including intercepted communications that alert the Ukrainian military to the presence of senior Russian officers — to conduct artillery strikes and other attacks that have killed Russian officers.\nThe intelligence sharing is part of a stepped-up flow in U.S. assistance that includes heavier weapons and tens of billions in aid, demonstrating how quickly the early American restraints on support for Ukraine have shifted as the war enters a new stage that could play out over months.\nU.S. intelligence support to the Ukrainians has had a decisive effect on the battlefield, confirming targets identified by the Ukrainian military and pointing it to new targets. The flow of actionable intelligence on the movement of Russian troops that America has given Ukraine has few precedents.\nSince failing to advance on Kyiv, the capital, in the early part of the war, Russia has tried to regroup, with a more concentrated push in eastern Ukraine that so far has moved slowly and unevenly.\nOfficials interviewed for this article spoke on the condition of anonymity to discuss details of the classified intelligence being shared with Ukraine.\nThe administration has sought to keep much of the battlefield intelligence secret, out of fear it will be seen as an escalation and provoke President Vladimir V. Putin of Russia into a wider war. American officials would not describe how they have acquired information on Russian troop headquarters, for fear of endangering their methods of collection. But throughout the war, the U.S. intelligence agencies have used a variety of sources, including classified and commercial satellites, to trace Russian troop movements.\nDefense Secretary Lloyd J. Austin III went so far as to say last month that “we want to see Russia weakened to the degree it cannot do the kinds of things that it has done in invading Ukraine.”\nAsked about the intelligence being provided to the Ukrainians, John F. Kirby, the Pentagon spokesman, said that “we will not speak to the details of that information.” But he acknowledged that the United States provides “Ukraine with information and intelligence that they can use to defend themselves.”\nNot all the strikes have been carried out with American intelligence. A strike over the weekend at a location in eastern Ukraine where Gen. Valery Gerasimov, Russia's highest-ranking uniformed officer, had visited was not aided by American intelligence, according to multiple U.S. officials. The United States prohibits itself from providing intelligence about the most senior Russian leaders, officials said.","image_url":"https://static01.nyt.com/images/2022/05/04/us/politics/04dc-generals1/merlin_206376120_ab8a35f5-2451-4b7c-8778-130a77405df3-jumbo.jpg?quality=75&auto=webp","source_id":"The New York Times","source_image_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/NewYorkTimes.svg/2560px-NewYorkTimes.svg.png","category":["Politics"]},{"title":"Addison Rae Rocks Barely-There Afterparty Dress Following 2022 Met Gala","keywords":["Celebrity","Met Gala","Style"],"url":"https://people.com/style/addison-rae-rocks-barely-there-afterparty-dress-following-2022-met-gala/","author":["Hattie Lindert"],"description":"The 21-year-old influencer changed from a sparkling, slinky halter gown to a see-through black ensemble at the end of the night","content":"Rae's afterparty look included an open back, high neck and flowing train with a high slit. She wore a black pair of underwear and nude nipple pasties underneath the ensemble, which she paired with a metallic clutch and cuff.\n\nIn the comments section of her Instagram post, Maddie Ziegler deemed Rae's look \"Hot,\" while Bella Thorne simply wrote, \"Stunning!\"","image_url":"https://hollywoodlife.com/wp-content/uploads/2022/05/addison-rae-met-gala-shutterstock-ftr.jpg","source_id":"People","source_image_url":"https://logodix.com/logo/846093.png","category":["Culture"]}]